# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [24]:
# your code here
import pandas as pd
import pymysql
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:XXXXXXXXXXXXXX@localhost/publications')

data = pd.read_sql_query("SELECT * FROM authors \
INNER JOIN titleauthor ON authors.au_id = titleauthor.au_id;", engine)

print(data)

          au_id        au_lname  au_fname         phone               address  \
0   172-32-1176           White   Johnson  408 496-7223       10932 Bigge Rd.
1   213-46-8915           Green  Marjorie  415 986-7020     309 63rd St. #411
2   213-46-8915           Green  Marjorie  415 986-7020     309 63rd St. #411
3   238-95-7766          Carson    Cheryl  415 548-7723        589 Darwin Ln.
4   267-41-2394         O'Leary   Michael  408 286-2428  22 Cleveland Av. #14
5   267-41-2394         O'Leary   Michael  408 286-2428  22 Cleveland Av. #14
6   274-80-9391        Straight      Dean  415 834-2919      5420 College Av.
7   409-56-7008          Bennet   Abraham  415 658-9932      6223 Bateman St.
8   427-17-2319            Dull       Ann  415 836-7128       3410 Blonde St.
9   472-27-2349      Gringlesby      Burt  707 938-6445            PO Box 792
10  486-29-1786        Locksley  Charlene  415 585-4620       18 Broadway Av.
11  486-29-1786        Locksley  Charlene  415 585-4620       18 Broadway Av.
12  648-92-1872  Blotchet-Halls  Reginald  503 745-6402      55 Hillsdale Bl.
13  672-71-3249        Yokomoto     Akiko  415 935-4228          3 Silver Ct.
14  712-45-1867    del Castillo     Innes  615 996-8275     2286 Cram Pl. #86
15  722-51-5454        DeFrance    Michel  219 547-9982         3 Balding Pl.
16  724-80-9391      MacFeather   Stearns  415 354-7128        44 Upland Hts.
17  724-80-9391      MacFeather   Stearns  415 354-7128        44 Upland Hts.
18  756-30-7391          Karsen     Livia  415 534-9219      5720 McAuley St.
19  807-91-6654        Panteley    Sylvia  301 946-8853    1956 Arlington Pl.
20  846-92-7186          Hunter    Sheryl  415 836-7128       3410 Blonde St.
21  899-46-2035          Ringer      Anne  801 826-0752        67 Seventh Av.
22  899-46-2035          Ringer      Anne  801 826-0752        67 Seventh Av.
23  998-72-3567          Ringer    Albert  801 826-0752        67 Seventh Av.
24  998-72-3567          Ringer    Albert  801 826-0752        67 Seventh Av.

              city state    zip  contract        au_id title_id  au_ord  \
0       Menlo Park    CA  94025         1  172-32-1176   PS3333       1
1          Oakland    CA  94618         1  213-46-8915   BU1032       2
2          Oakland    CA  94618         1  213-46-8915   BU2075       1
3         Berkeley    CA  94705         1  238-95-7766   PC1035       1
4         San Jose    CA  95128         1  267-41-2394   BU1111       2
5         San Jose    CA  95128         1  267-41-2394   TC7777       2
6          Oakland    CA  94609         1  274-80-9391   BU7832       1
7         Berkeley    CA  94705         1  409-56-7008   BU1032       1
8        Palo Alto    CA  94301         1  427-17-2319   PC8888       1
9           Covelo    CA  95428         1  472-27-2349   TC7777       3
10   San Francisco    CA  94130         1  486-29-1786   PC9999       1
11   San Francisco    CA  94130         1  486-29-1786   PS7777       1
12       Corvallis    OR  97330         1  648-92-1872   TC4203       1
13    Walnut Creek    CA  94595         1  672-71-3249   TC7777       1
14       Ann Arbor    MI  48105         1  712-45-1867   MC2222       1
15            Gary    IN  46403         1  722-51-5454   MC3021       1
16         Oakland    CA  94612         1  724-80-9391   BU1111       1
17         Oakland    CA  94612         1  724-80-9391   PS1372       2
18         Oakland    CA  94609         1  756-30-7391   PS1372       1
19       Rockville    MD  20853         1  807-91-6654   TC3218       1
20       Palo Alto    CA  94301         1  846-92-7186   PC8888       2
21  Salt Lake City    UT  84152         1  899-46-2035   MC3021       2
22  Salt Lake City    UT  84152         1  899-46-2035   PS2091       2
23  Salt Lake City    UT  84152         1  998-72-3567   PS2091       1
24  Salt Lake City    UT  84152         1  998-72-3567   PS2106       1

    royaltyper
0          100
1           40
2          100
3          100
4           40
5           30
6          100
7           60
8           50
9           30
10         100
11         100
12         100
13          40
14         100
15          75
16          60
17          25
18          75
19         100
20          50
21          25
22          50
23          50
24         100

# Challenge 2 - Working with JSON files

Import the pandas library.

In [36]:
# your code here
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [46]:
# your code here
nasa = pd.read_json(r"C:\Users\CLAUDIOCLEMENTE\Bootcamp\dataV2-labs\module-1\Importing-Exporting-Data\data\nasa.json",orient='records')
nasa

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000
...,...,...,...,...,...,...,...,...,...,...,...,...
995,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [79.41667, 13...",24009,230.0,Tirupati,Valid,H6,13.63333,79.41667,1934-01-01T00:00:00.000
996,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-7.61123, 29...",54823,7000.0,Tissint,Valid,Martian (shergottite),29.48195,-7.61123,2011-01-01T00:00:00.000
997,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [111.53333, -...",24011,20000.0,Tjabe,Valid,H6,-7.08333,111.53333,1869-01-01T00:00:00.000
998,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [106.58333, -...",24012,16500.0,Tjerebon,Valid,L5,-6.66667,106.58333,1922-01-01T00:00:00.000
999,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [34.76667, 47...",24019,600.0,Tomakovka,Valid,LL6,47.85000,34.76667,1905-01-01T00:00:00.000

Now that we have loaded the data, let's examine it using the `head()` function.

In [48]:
# your code here
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [51]:
# your code here
nasa['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [53]:
# your code here
nasa.to_json(r"C:\Users\CLAUDIOCLEMENTE\Bootcamp\dataV2-labs\module-1\Importing-Exporting-Data\data\nasa-output.json", orient="records")

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [54]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [62]:
# your code here
shuttle = pd.read_csv(tst_url, sep = ' ',names = cols )

shuttle

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1
...,...,...,...,...,...,...,...,...,...
80,0,84,0,-36,-29,4,120,116,5
55,0,81,0,-20,25,26,102,76,4
55,0,77,0,12,-22,22,65,42,4
37,0,103,0,18,-16,66,85,20,1
56,2,98,0,52,1,42,46,4,4

Let's verify that this worked by looking at the `head()` function.

In [63]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [65]:
# your code here
shuttle.to_csv(r"C:\Users\CLAUDIOCLEMENTE\Bootcamp\dataV2-labs\module-1\Importing-Exporting-Data\data\shuttle.csv",index=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [68]:
# your code here
import xlrd

astronaut = pd.read_excel(r'C:\Users\CLAUDIOCLEMENTE\Bootcamp\dataV2-labs\module-1\Importing-Exporting-Data\data\astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [69]:
# your code here
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [70]:
# your code here
astronaut['Undergraduate Major'].value_counts()

Physics                      35
Aerospace Engineering        33
Mechanical Engineering       30
Aeronautical Engineering     28
Electrical Engineering       23
                             ..
Military Engineering          1
Biology & Psychology          1
Earth & Planetary Science     1
Ecological Science            1
Music                         1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [71]:
# your code here
astronaut.to_csv(r"C:\Users\CLAUDIOCLEMENTE\Bootcamp\dataV2-labs\module-1\Importing-Exporting-Data\data\astronaut.csv",index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [81]:
# your code here
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt"
cols = ["Season","Age","Childish diseases", "Accident/trauma","Surg. interv." "High fevers L5Y",\
        "Daily alc. cons.", "Hours sitting", "Output"] 

fertility = pd.read_csv(url, sep = ",", names = cols)
fertility.head()

            Season  Age  Childish diseases  Accident/trauma  \
-0.33 0.69       0    1                  1                0
      0.94       1    0                  1                0
      0.50       1    0                  0                0
      0.75       0    1                  1                0
      0.67       1    1                  0                0

            Surg. interv.High fevers L5Y  Daily alc. cons.  Hours sitting  \
-0.33 0.69                           0.8                 0           0.88
      0.94                           0.8                 1           0.31
      0.50                           1.0                -1           0.50
      0.75                           1.0                -1           0.38
      0.67                           0.8                -1           0.50

           Output
-0.33 0.69      N
      0.94      O
      0.50      N
      0.75      N
      0.67      O